<a href="https://colab.research.google.com/github/mkmahto2/python/blob/master/day_4_assignment_data_science_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

  **Assignment Day 4 | 13th November 2020
Name: 
Mukesh Kumar mahto**
 
**Email:** :
 mukeshmh001@gmail.com

**Questions 1:**
How to import pandas and check the version?

In [ ]:
 import pandas as pd
print(pd.__version__)
data = pd.read_csv("student.csv")

1.1.4

     Name OverallGrade Obedient  ResearchScore  ProjectScore Recommend
0   Henry            A        Y             90            85       Yes
1    John            C        N             85            51       Yes
2   David            F        N             10            17        No
3  Holmes            B        Y             75            71        No
4  Marvin            E        N             20            30        No

 **Questions 2:**

How to create a series from a numpy array?

In [ ]:
 
# importing Pandas & numpy 
 
import pandas as pd 
 
import numpy as np 
 
  
# numpy array 
 
data = np.array(['a', 'b', 'c', 'd', 'e']) 
 
  
# creating series 
 
s = pd.Series(data) 
 
print(s)

0    a
1    b
2    c
3    d
4    e
dtype: object

**Questions 3:**

How to convert the index of a series into a column of a dataframe?

In [ ]:
 
# importing the pandas library as pd 
 
import pandas as pd 
 
  
 
  
# Creating the dataframe df 
 
df = pd.DataFrame({'Roll Number': ['20CSE29', '20CSE49', '20CSE36', '20CSE44'], 
 
                   'Name': ['Amelia', 'Sam', 'Dean', 'Jessica'], 
 
                   'Marks In Percentage': [97, 90, 70, 82], 
 
                   'Grade': ['A', 'A', 'C', 'B'], 
 
                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']}) 
 
  
# Printing the dataframe 
df

  Roll Number     Name  Marks In Percentage Grade  Subject
0     20CSE29   Amelia                   97     A  Physics
1     20CSE49      Sam                   90     A  Physics
2     20CSE36     Dean                   70     C  Physics
3     20CSE44  Jessica                   82     B  Physics

 **Questions 4:**
 
Write the code to list all the datasets available in seaborn library.
Load the 'mpg' dataset
Note: mpg dataset will be read from seaborn module in the manner sir has already shown(provided in the
materials folder

In [ ]:
import seaborn as srs
mv = srs.load_dataset('mpg')
mv.head()

    mpg  cylinders  displacement  ...  model_year  origin                       name
0  18.0          8         307.0  ...          70     usa  chevrolet chevelle malibu
1  15.0          8         350.0  ...          70     usa          buick skylark 320
2  18.0          8         318.0  ...          70     usa         plymouth satellite
3  16.0          8         304.0  ...          70     usa              amc rebel sst
4  17.0          8         302.0  ...          70     usa                ford torino

[5 rows x 9 columns]

In [ ]:
 list(mv.columns)

['mpg',
 'cylinders',
 'displacement',
 'horsepower',
 'weight',
 'acceleration',
 'model_year',
 'origin',
 'name']

 **Questions 5:**

Which country origin cars are a part of this dataset?

In [ ]:
mv['origin'].unique()
mv['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

 **Questions 6:**
 
Extract the part of the dataframe which contains cars belonging to 'usa'

In [ ]:
 
 
df = DataFrame(mv, columns = ['name', 'model_year','cylinders', 'horsepower', 'displacement', 'weight', 'origin']) 
 
  
 
 
  
# Selecting the product of usa Type 
 
select_prod = df.loc[df['origin'] == 'usa'] 
 
  
 
print("\n") 
 
  
# Print selected rows based on the condition 
 
print("Selecting rows:\n") 
 
print (select_prod)

Selecting rows:

                          name  model_year  ...  weight  origin
0    chevrolet chevelle malibu          70  ...    3504     usa
1            buick skylark 320          70  ...    3693     usa
2           plymouth satellite          70  ...    3436     usa
3                amc rebel sst          70  ...    3433     usa
4                  ford torino          70  ...    3449     usa
..                         ...         ...  ...     ...     ...
392           chevrolet camaro          82  ...    2950     usa
393            ford mustang gl          82  ...    2790     usa
395              dodge rampage          82  ...    2295     usa
396                ford ranger          82  ...    2625     usa
397                 chevy s-10          82  ...    2720     usa

[249 rows x 7 columns]